{
  "_name_or_path": "airesearch/wangchanberta-base-att-spm-uncased",
  "architectures": [
    "CamembertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B",
    "1": "B_ANI",
    "2": "B_ANT",
    "3": "B_BOLE",
    "4": "B_BRN",
    "5": "B_CON",
    "6": "B_COU",
    "7": "B_DES",
    "8": "B_DIS",
    "9": "B_DSE",
    "10": "B_DTM",
    "11": "B_DUR",
    "12": "B_EDU",
    "13": "B_ERA",
    "14": "B_ETH",
    "15": "B_EVH",
    "16": "B_EVO",
    "17": "B_FOO",
    "18": "B_GOD",
    "19": "B_LOC",
    "20": "B_MAT",
    "21": "B_MEA",
    "22": "B_MOU",
    "23": "B_NAT",
    "24": "B_NIC",
    "25": "B_NPL",
    "26": "B_NUM",
    "27": "B_OCE",
    "28": "B_ORG",
    "29": "B_PER",
    "30": "B_POL",
    "31": "B_PRO",
    "32": "B_PRT",
    "33": "B_PSE",
    "34": "B_R",
    "35": "B_REL",
    "36": "B_RIV",
    "37": "B_ROA",
    "38": "B_ROG",
    "39": "B_ROLE",
    "40": "B_RPL",
    "41": "B_STA",
    "42": "B_STY",
    "43": "B_SUB",
    "44": "B_TRM",
    "45": "B_TTL",
    "46": "B_VEH",
    "47": "B_VIL",
    "48": "B_WEA",
    "49": "E_ANI",
    "50": "E_ANT",
    "51": "E_CLS_VEO",
    "52": "E_CON",
    "53": "E_COU",
    "54": "E_DES",
    "55": "E_DEU",
    "56": "E_DIS",
    "57": "E_DSE",
    "58": "E_DTM",
    "59": "E_DUR",
    "60": "E_EDU",
    "61": "E_ERA",
    "62": "E_ETH",
    "63": "E_EVH",
    "64": "E_EVO",
    "65": "E_FOO",
    "66": "E_LDIS",
    "67": "E_LOC",
    "68": "E_MAT",
    "69": "E_MEA",
    "70": "E_MOU",
    "71": "E_NAT",
    "72": "E_NIC",
    "73": "E_NOL",
    "74": "E_NPL",
    "75": "E_NUM",
    "76": "E_ORG",
    "77": "E_PER",
    "78": "E_POL",
    "79": "E_PRL",
    "80": "E_PRO",
    "81": "E_PRT",
    "82": "E_PSE",
    "83": "E_REL",
    "84": "E_RIV",
    "85": "E_ROA",
    "86": "E_ROAD",
    "87": "E_ROG",
    "88": "E_ROLE",
    "89": "E_ROLED",
    "90": "E_ROLEG",
    "91": "E_RPL",
    "92": "E_STA",
    "93": "E_STY",
    "94": "E_SUB",
    "95": "E_TRM",
    "96": "E_VEH",
    "97": "E_VEO",
    "98": "E_VIL",
    "99": "E_WEA",
    "100": "I_ANT",
    "101": "I_CON",
    "102": "I_COU",
    "103": "I_DES",
    "104": "I_DEU",
    "105": "I_DIS",
    "106": "I_DSE",
    "107": "I_DTM",
    "108": "I_DUR",
    "109": "I_EDU",
    "110": "I_ERA",
    "111": "I_EVH",
    "112": "I_EVO",
    "113": "I_LOC",
    "114": "I_MAT",
    "115": "I_MEA",
    "116": "I_NPL",
    "117": "I_NUM",
    "118": "I_ORG",
    "119": "I_PER",
    "120": "I_POL",
    "121": "I_PRO",
    "122": "I_PRT",
    "123": "I_PSE",
    "124": "I_RIV",
    "125": "I_ROA",
    "126": "I_ROLE",
    "127": "I_RPL",
    "128": "I_STY",
    "129": "I_SUB",
    "130": "I_TTL",
    "131": "I_VEH",
    "132": "I_VEO",
    "133": "I_VIL",
    "134": "I_WEA",
    "135": "N_POL",
    "136": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B": 0,
    "B_ANI": 1,
    "B_ANT": 2,
    "B_BOLE": 3,
    "B_BRN": 4,
    "B_CON": 5,
    "B_COU": 6,
    "B_DES": 7,
    "B_DIS": 8,
    "B_DSE": 9,
    "B_DTM": 10,
    "B_DUR": 11,
    "B_EDU": 12,
    "B_ERA": 13,
    "B_ETH": 14,
    "B_EVH": 15,
    "B_EVO": 16,
    "B_FOO": 17,
    "B_GOD": 18,
    "B_LOC": 19,
    "B_MAT": 20,
    "B_MEA": 21,
    "B_MOU": 22,
    "B_NAT": 23,
    "B_NIC": 24,
    "B_NPL": 25,
    "B_NUM": 26,
    "B_OCE": 27,
    "B_ORG": 28,
    "B_PER": 29,
    "B_POL": 30,
    "B_PRO": 31,
    "B_PRT": 32,
    "B_PSE": 33,
    "B_R": 34,
    "B_REL": 35,
    "B_RIV": 36,
    "B_ROA": 37,
    "B_ROG": 38,
    "B_ROLE": 39,
    "B_RPL": 40,
    "B_STA": 41,
    "B_STY": 42,
    "B_SUB": 43,
    "B_TRM": 44,
    "B_TTL": 45,
    "B_VEH": 46,
    "B_VIL": 47,
    "B_WEA": 48,
    "E_ANI": 49,
    "E_ANT": 50,
    "E_CLS_VEO": 51,
    "E_CON": 52,
    "E_COU": 53,
    "E_DES": 54,
    "E_DEU": 55,
    "E_DIS": 56,
    "E_DSE": 57,
    "E_DTM": 58,
    "E_DUR": 59,
    "E_EDU": 60,
    "E_ERA": 61,
    "E_ETH": 62,
    "E_EVH": 63,
    "E_EVO": 64,
    "E_FOO": 65,
    "E_LDIS": 66,
    "E_LOC": 67,
    "E_MAT": 68,
    "E_MEA": 69,
    "E_MOU": 70,
    "E_NAT": 71,
    "E_NIC": 72,
    "E_NOL": 73,
    "E_NPL": 74,
    "E_NUM": 75,
    "E_ORG": 76,
    "E_PER": 77,
    "E_POL": 78,
    "E_PRL": 79,
    "E_PRO": 80,
    "E_PRT": 81,
    "E_PSE": 82,
    "E_REL": 83,
    "E_RIV": 84,
    "E_ROA": 85,
    "E_ROAD": 86,
    "E_ROG": 87,
    "E_ROLE": 88,
    "E_ROLED": 89,
    "E_ROLEG": 90,
    "E_RPL": 91,
    "E_STA": 92,
    "E_STY": 93,
    "E_SUB": 94,
    "E_TRM": 95,
    "E_VEH": 96,
    "E_VEO": 97,
    "E_VIL": 98,
    "E_WEA": 99,
    "I_ANT": 100,
    "I_CON": 101,
    "I_COU": 102,
    "I_DES": 103,
    "I_DEU": 104,
    "I_DIS": 105,
    "I_DSE": 106,
    "I_DTM": 107,
    "I_DUR": 108,
    "I_EDU": 109,
    "I_ERA": 110,
    "I_EVH": 111,
    "I_EVO": 112,
    "I_LOC": 113,
    "I_MAT": 114,
    "I_MEA": 115,
    "I_NPL": 116,
    "I_NUM": 117,
    "I_ORG": 118,
    "I_PER": 119,
    "I_POL": 120,
    "I_PRO": 121,
    "I_PRT": 122,
    "I_PSE": 123,
    "I_RIV": 124,
    "I_ROA": 125,
    "I_ROLE": 126,
    "I_RPL": 127,
    "I_STY": 128,
    "I_SUB": 129,
    "I_TTL": 130,
    "I_VEH": 131,
    "I_VEO": 132,
    "I_VIL": 133,
    "I_WEA": 134,
    "N_POL": 135,
    "O": 136
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "camembert",
  "num_attention_head": 12,
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.48.3",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 25005
}
